virtualrobotix/vrbrain_nuttx/src/drivers/stm32/drv_pwm_input.c
/****************************************************************************
 *
 *   Copyright (C) 2012 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/*
 * @file drv_pwm_input.c
 *
 * Servo driver supporting PWM inputs connected to STM32 timer blocks.
 *
 * Works with any of the 'generic' or 'advanced' STM32 timers that
 * have output pins, does not require an interrupt.
 */

#include <board_config.h>

#if CONFIG_RC_INPUTS_TYPE(RC_INPUT_PWM)

#include <px4_config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdbool.h>

#include <assert.h>
#include <debug.h>
#include <time.h>
#include <queue.h>
#include <errno.h>
#include <string.h>
#include <stdio.h>

#include <arch/board/board.h>
#include <drivers/drv_rc_input.h>

#include "drv_pwm_input.h"

#include <systemlib/ppm_decode.h>

#include <chip.h>
#include <up_internal.h>
#include <up_arch.h>

#include <stm32.h>
#include <stm32_gpio.h>
#include <stm32_tim.h>

uint32_t status;
uint16_t rc[PWM_INPUT_MAX_CHANNELS];
uint16_t rc_last[PWM_INPUT_MAX_CHANNELS];

struct rc_input_values rc_in;
orb_advert_t to_input_rc = 0;

__EXPORT uint16_t ppm_buffer[PPM_MAX_CHANNELS];
__EXPORT uint16_t ppm_frame_length = 0;
__EXPORT unsigned ppm_decoded_channels = 0;
__EXPORT uint64_t ppm_last_valid_decode = 0;

#define MAX_PULSEWIDTH 2000

#define REG(_tmr, _reg)	(*(volatile uint32_t *)(pwm_input_timers[_tmr].base + _reg))

#define rCR1(_tmr)    	REG(_tmr, STM32_GTIM_CR1_OFFSET)
#define rCR2(_tmr)    	REG(_tmr, STM32_GTIM_CR2_OFFSET)
#define rSMCR(_tmr)   	REG(_tmr, STM32_GTIM_SMCR_OFFSET)
#define rDIER(_tmr)   	REG(_tmr, STM32_GTIM_DIER_OFFSET)
#define rSR(_tmr)     	REG(_tmr, STM32_GTIM_SR_OFFSET)
#define rEGR(_tmr)    	REG(_tmr, STM32_GTIM_EGR_OFFSET)
#define rCCMR1(_tmr)  	REG(_tmr, STM32_GTIM_CCMR1_OFFSET)
#define rCCMR2(_tmr)  	REG(_tmr, STM32_GTIM_CCMR2_OFFSET)
#define rCCER(_tmr)   	REG(_tmr, STM32_GTIM_CCER_OFFSET)
#define rCNT(_tmr)    	REG(_tmr, STM32_GTIM_CNT_OFFSET)
#define rPSC(_tmr)    	REG(_tmr, STM32_GTIM_PSC_OFFSET)
#define rARR(_tmr)    	REG(_tmr, STM32_GTIM_ARR_OFFSET)
#define rCCR1(_tmr)   	REG(_tmr, STM32_GTIM_CCR1_OFFSET)
#define rCCR2(_tmr)   	REG(_tmr, STM32_GTIM_CCR2_OFFSET)
#define rCCR3(_tmr)   	REG(_tmr, STM32_GTIM_CCR3_OFFSET)
#define rCCR4(_tmr)   	REG(_tmr, STM32_GTIM_CCR4_OFFSET)
#define rDCR(_tmr)    	REG(_tmr, STM32_GTIM_DCR_OFFSET)
#define rDMAR(_tmr)   	REG(_tmr, STM32_GTIM_DMAR_OFFSET)
#define rBDTR(_tmr)		REG(_tmr, STM32_ATIM_BDTR_OFFSET)

static void		pwm_input_timer_init(unsigned timer);
static void		pwm_input_timer_set_rate(unsigned timer, unsigned rate);
static void		pwm_input_channel_init(unsigned channel);
static int		pwm_input_timer_isr(int irq, void *context);

int             up_pwm_input_set(unsigned channel, rc_input_t value);
rc_input_t      up_pwm_input_get(unsigned channel);
void            up_pwm_init_deinit(void);
void            up_pwm_input_arm(bool armed);
int             up_pwm_init_set_rate_group_update(unsigned group, unsigned rate);
int             up_pwm_input_set_rate(unsigned rate);
uint32_t        up_pwm_input_get_rate_group(unsigned group);

static void
pwm_input_timer_init(unsigned timer)
{
	/* enable the timer clock before we try to talk to it */
	modifyreg32(pwm_input_timers[timer].clock_register, 0, pwm_input_timers[timer].clock_bit);
	
	/* disable and configure the timer */
	rCR1(timer)   |= 0;
	rCR2(timer)   |= 0;
	rSMCR(timer)  |= 0;
	rDIER(timer)  |= 0;
	rCCER(timer)  |= 0;
	rCCMR1(timer) |= 0;
	rCCMR2(timer) |= 0;
	rCCER(timer)  |= 0;
	rDCR(timer)   |= 0;

//	if ((pwm_input_timers[timer].base == STM32_TIM1_BASE) || (pwm_input_timers[timer].base == STM32_TIM8_BASE)) {
//		/* master output enable = on */
//		rBDTR(timer) = ATIM_BDTR_MOE;
//	}

	/* configure the timer to free-run at 1MHz */
	rPSC(timer)   |= (pwm_input_timers[timer].clock_freq / 1000000) - 1;

	/* run the full span of the counter */
	rARR(timer)   |= 0xffff;
	
	/* generate an update event; reloads the counter, all registers */
	rEGR(timer) |= GTIM_EGR_UG ;
	
	/* enable the timer */
	rCR1(timer) |= GTIM_CR1_CEN;
}

static void
pwm_input_timer_set_rate(unsigned timer, unsigned rate)
{
	/* configure the timer to update at the desired rate */
	rARR(timer) |= 1000000 / rate;

	/* generate an update event; reloads the counter and all registers */
	rEGR(timer) |= GTIM_EGR_UG;
}

static void
pwm_input_channel_init(unsigned channel)
{
	unsigned timer = pwm_input_channels[channel].timer_index;

	/* configure the GPIO first */
	stm32_configgpio(pwm_input_channels[channel].gpio);

	/* configure the channel */
	switch (pwm_input_channels[channel].timer_channel) {
	case 1:
		rCCMR1(timer) |= (GTIM_CCMR_CCS_CCIN1<<GTIM_CCMR1_CC1S_SHIFT)|(GTIM_CCMR_ICF_FCKINT8<<GTIM_CCMR1_IC1F_SHIFT);

		rCCER(timer)  |= GTIM_CCER_CC1E|GTIM_CCER_CC1P|GTIM_CCER_CC1NP;
		rDIER(timer)  |= GTIM_DIER_CC1IE;
		break;

	case 2:
		rCCMR1(timer) |= (GTIM_CCMR_CCS_CCIN1<<GTIM_CCMR1_CC2S_SHIFT)|(GTIM_CCMR_ICF_FCKINT8<<GTIM_CCMR1_IC2F_SHIFT);

		rCCER(timer)  |= GTIM_CCER_CC2E|GTIM_CCER_CC2P|GTIM_CCER_CC2NP;
		rDIER(timer)  |= GTIM_DIER_CC2IE;
		break;

	case 3:
		rCCMR2(timer) |= (GTIM_CCMR_CCS_CCIN1<<GTIM_CCMR2_CC3S_SHIFT)|(GTIM_CCMR_ICF_FCKINT8<<GTIM_CCMR2_IC3F_SHIFT);

		rCCER(timer)  |= GTIM_CCER_CC3E|GTIM_CCER_CC3P|GTIM_CCER_CC3NP;
		rDIER(timer)  |= GTIM_DIER_CC3IE;
		break;

	case 4:
		rCCMR2(timer) |= (GTIM_CCMR_CCS_CCIN1<<GTIM_CCMR2_CC4S_SHIFT)|(GTIM_CCMR_ICF_FCKINT8<<GTIM_CCMR2_IC4F_SHIFT);

		rCCER(timer)  |= GTIM_CCER_CC4E|GTIM_CCER_CC4P|GTIM_CCER_CC4NP;
		rDIER(timer)  |= GTIM_DIER_CC4IE;
		break;
	}
}

int
up_pwm_input_set(unsigned channel, rc_input_t value)
{
	if (channel >= PWM_INPUT_MAX_CHANNELS)
		return -1;

	unsigned timer = pwm_input_channels[channel].timer_index;

	/* test timer for validity */
	if ((pwm_input_timers[timer].base == 0) ||
	    (pwm_input_channels[channel].gpio == 0))
		return -1;

	/* configure the channel */
	if (value > 0)
		value--;

	switch (pwm_input_channels[channel].timer_channel) {
	case 1:
		rCCR1(timer) = value;
		break;

	case 2:
		rCCR2(timer) = value;
		break;

	case 3:
		rCCR3(timer) = value;
		break;

	case 4:
		rCCR4(timer) = value;
		break;

	default:
		return -1;
	}

	return 0;
}

rc_input_t
up_pwm_input_get(unsigned channel)
{
	if (channel >= PWM_INPUT_MAX_CHANNELS)
		return 0;

	unsigned timer = pwm_input_channels[channel].timer_index;
	rc_input_t value = 0;

	/* test timer for validity */
	if ((pwm_input_timers[timer].base == 0) ||
	    (pwm_input_channels[channel].timer_channel == 0))
		return 0;

	/* configure the channel */
	switch (pwm_input_channels[channel].timer_channel) {
	case 1:
		value = rCCR1(timer);
		break;

	case 2:
		value = rCCR2(timer);
		break;

	case 3:
		value = rCCR3(timer);
		break;

	case 4:
		value = rCCR4(timer);
		break;
	}

	return value + 1;
}

int
up_pwm_input_init(uint32_t channel_mask)
{
	memset(&rc_in, 0, sizeof(rc_in));
	rc_in.input_source = RC_INPUT_SOURCE_VRBRAIN_PWM;

	/* attach interrupt for the timers */
	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++) {
		if (pwm_input_timers[i].base != 0)
			irq_attach(pwm_input_timers[i].vector, pwm_input_timer_isr);
	}

	/* do basic timer initialisation first */
	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++) {
		if (pwm_input_timers[i].base != 0)
			pwm_input_timer_init(i);
	}

	/* now init channels */
	for (unsigned i = 0; i < PWM_INPUT_MAX_CHANNELS; i++) {
		/* don't do init for disabled channels; this leaves the pin configs alone */
		if (((1 << i) & channel_mask) && (pwm_input_channels[i].timer_channel != 0))
			pwm_input_channel_init(i);
	}

	/* enable IRQs of timers */
	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++) {
		if (pwm_input_timers[i].base != 0)
			up_enable_irq(pwm_input_timers[i].vector);
	}

	return OK;
}

void
up_pwm_init_deinit(void)
{
	/* disable the timers */
	up_pwm_input_arm(false);
}

int
up_pwm_init_set_rate_group_update(unsigned group, unsigned rate)
{
	/* limit update rate to 1..10000Hz; somewhat arbitrary but safe */
	if (rate < 1)
		return -ERANGE;
	if (rate > 10000)
		return -ERANGE;

	if ((group >= PWM_INPUT_MAX_TIMERS) || (pwm_input_timers[group].base == 0))
		return ERROR;

	pwm_input_timer_set_rate(group, rate);

	return OK;
}

int
up_pwm_input_set_rate(unsigned rate)
{
//	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++)
//		up_pwm_input_set_rate_group_update(i, rate);

	return 0;
}

uint32_t
up_pwm_input_get_rate_group(unsigned group)
{
	unsigned channels = 0;

	for (unsigned i = 0; i < PWM_INPUT_MAX_CHANNELS; i++) {
		if ((pwm_input_channels[i].gpio != 0) && (pwm_input_channels[i].timer_index == group))
			channels |= (1 << i);
	}
	return channels;
}

void
up_pwm_input_arm(bool armed)
{
	/* iterate timers and arm/disarm appropriately */
	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++) {
		if (pwm_input_timers[i].base != 0) {
			if (armed) {
				/* force an update to preload all registers */
				rEGR(i) = GTIM_EGR_UG;

				/* arm requires the timer be enabled */
				rCR1(i) |= GTIM_CR1_CEN | GTIM_CR1_ARPE;

			} else {
				// XXX This leads to FMU PWM being still active
				// but uncontrollable. Just disable the timer
				// and risk a runt.
				///* on disarm, just stop auto-reload so we don't generate runts */
				//rCR1(i) &= ~GTIM_CR1_ARPE;
				rCR1(i) = 0;
			}
		}
	}
}

static int pwm_input_timer_isr(int irq, void *context)
{
	uint16_t count = 0;

	for (unsigned i = 0; i < PWM_INPUT_MAX_TIMERS; i++) {
		status = rSR(i);
		 //ack the interrupts we just read
		rSR(i) = ~status;

		if (status & (GTIM_SR_CC1IF | GTIM_SR_CC1OF))
		{
			count = rCCR1(i);
			//printf("Captured on T%uC1  %u\n", i, count);
			for (unsigned j = 0; j < PWM_INPUT_MAX_CHANNELS; j++) {
				if ((pwm_input_channels[j].timer_channel == 1) && (pwm_input_channels[j].timer_index == i)) {

					rc[j] = count - rc_last[j];
					rc_last[j] = count;

					if (rc[j] <= MAX_PULSEWIDTH) {
						ppm_buffer[j]=rc[j];
						ppm_last_valid_decode = hrt_absolute_time();
					}

					//printf("RC%u: %u\n", j, rc[j]);
				}
			}
		}
		if (status & (GTIM_SR_CC2IF | GTIM_SR_CC2OF))
		{
			count = rCCR2(i);
			//printf("Captured on T%uC2  %u\n", i, count);
			for (unsigned j = 0; j < PWM_INPUT_MAX_CHANNELS; j++) {
				if ((pwm_input_channels[j].timer_channel == 2) && (pwm_input_channels[j].timer_index == i)) {

					rc[j] = count - rc_last[j];
					rc_last[j] = count;

					if (rc[j] <= MAX_PULSEWIDTH) {
						ppm_buffer[j]=rc[j];
						ppm_last_valid_decode = hrt_absolute_time();
					}

					//printf("RC%u: %u\n", j, rc[j]);
				}
			}
		}
		if (status & (GTIM_SR_CC3IF | GTIM_SR_CC3OF))
		{
			count = rCCR3(i);
			//printf("Captured on T%uC3  %u\n", i, count);
			for (unsigned j = 0; j < PWM_INPUT_MAX_CHANNELS; j++) {
				if ((pwm_input_channels[j].timer_channel == 3) && (pwm_input_channels[j].timer_index == i)) {

					rc[j] = count - rc_last[j];
					rc_last[j] = count;

					if (rc[j] <= MAX_PULSEWIDTH) {
						ppm_buffer[j]=rc[j];
						ppm_last_valid_decode = hrt_absolute_time();
					}

					//printf("RC%u: %u\n", j, rc[j]);
				}
			}
		}
		if (status & (GTIM_SR_CC4IF | GTIM_SR_CC4OF))
		{
			count = rCCR4(i);
			//printf("Captured on T%uC3  %u\n", i, count);
			for (unsigned j = 0; j < PWM_INPUT_MAX_CHANNELS; j++) {
				if ((pwm_input_channels[j].timer_channel == 4) && (pwm_input_channels[j].timer_index == i)) {

					rc[j] = count - rc_last[j];
					rc_last[j] = count;

					if (rc[j] <= MAX_PULSEWIDTH) {
						ppm_buffer[j]=rc[j];
						ppm_last_valid_decode = hrt_absolute_time();
					}

					//printf("RC%u: %u\n", j, rc[j]);
				}
			}
		}
	}

	return  OK;
  	
}

#endif
